name = 'Сейчас на Земле появился новый вид роботов. Раньше их называли „железной оравой “, но это не очень точное определение'
print(name[:44]) #Задача 1

name1 = 'радар'
name2 = 'норма'
print(name1[::-1])
print(name2[::-1]) #Задача 2

name3 = 'кенгуру'
a=len(name3)//2+len(name3)%2
print(name3[a:]+name3[:a]) #Задача 3

name4 = 'нейропрограммирование'
print(name4[::2])
print(name4[1::2]) #Задача 4

name5 = 'нейропластичность'
name5 = name5[1:len(name5)-1]
print(name5[::-1])  #Задача 5
